config.org
:PROPERTIES:
:HEADER-ARGS:emacs-lisp:  :mkdirp yes
:HEADER-ARGS:emacs-lisp+: :tangle (let ((org-use-tag-inheritance t)) (if (or (member "KEYS" (org-get-tags)) (member "INACTIVE" (org-get-tags)))  "no" "modules/clayemacs.el")))
:HEADER-ARGS:emacs-lisp+: :noweb tangle :shebang ;; -*- lexical-binding: t -*-
:HEADER-ARGS:emacs-lisp+: :padline    (let ((org-use-tag-inheritance t)) (if (member "END" (org-get-tags)) "no" "yes"))
:HEADER-ARGS:emacs-lisp+: :noweb-ref (let ((org-use-tag-inheritance t)) (if (member "KEYS" (org-get-tags)) "keybinding" "no"))
:END:
#+TITLE: My Emacs Configuration
#+AUTHOR: Lucas Elvira Martín
#+DATE: [2023-12-07 Thu]
#+STARTUP: overview
#+TAGS: INACTIVE(i) TOC(t)
#+auto_tangle: nil
#+EXPORT_FILE_NAME: README
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil expand-links:t f:t inline:t num:t p:nil pri:nil prop:nil
#+options: stat:t tags:t tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: config
#+date: <2024-07-10 Wed>
#+author: Lucas Elvira Martín
#+email: lucaselvira96@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.3 (Org mode 9.7-pre)
#+cite_export:

* ClayEMACS

** About

** About this README

** Enable literature configuration

Emacs allows to export src blocks to a ~.el~ file and load them. This is a great
option if you would like to describe each part of the configuation and explain a
bit of them. To make them, you need to create a ~init.el~ file with the following
code.

*Note* When I move to straight there is a bug with org-mode than generate a
conflict with this method. I need to tangle manually all the config to the
~init.el~ file and ~early-init.el~ file respectively.

#+begin_example emacs-lisp :tangle no
(org-babel-load-file
(expand-file-name
"config.org"
  user-emacs-directory))
#+end_example

* Startup

** Lexical binding
:PROPERTIES:
:VISIBILITY: folded
:END:
Lexical binding is a mode that allows to use special features of the languages.
It options tell the configuration that works as a program more than just a
simple configuration

#+INLUDE: "init.el" src emacs-lisp :lines "1-2"

This will generate a header at the top of the tangled file to indicate it is generated and is not meant to be modified directly.

#+name: header
#+begin_src emacs-lisp :tangle no
;; This file is not part of GNU Emacs

;; This program is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.


;;; Commentary:

;; This file has been automatically generated. DO NOT EDIT.
;; Sources are available from https://github.com/luelvira/dotfiles/

;;; Code:
#+end_src

* Early init
:PROPERTIES:
:VISIBILITY: folded
:HEADER-ARGS:emacs-lisp+: :tangle "early-init.el"
:HEADER-ARGS:emacs-lisp+: :shebang ;;; early-init.el --- early init file -*- lexical-binding: t -*-
:END:

#+begin_src emacs-lisp
<<header>>
#+end_src

The /early-init/ file is loaded before any process of emacs, either the package
system. So I will configure the directories used by Emacs to prevent the default
behavior which get dirty the configuration folder.

#+begin_src emacs-lisp
;; SetupFolder
(defvar private-emacs-directory nil
  "The folder where the Emacs configuration is stored.")
(setq private-emacs-directory user-emacs-directory
      ;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
      user-emacs-directory (expand-file-name "~/.cache/emacs/")
      url-history-file (expand-file-name "url/history" user-emacs-directory))
;; -SetupFolder
#+end_src



Package initialize occurs automatically, before user-init-file is loaded, but
after early-init file. We handle package initialization, so we must prevent
Emacs from doing it early! I use straight as package manager, so I need to
disable the default behavior before the ~package.el~ is loaded.

#+begin_src emacs-lisp
;; DisablePackage
(setq package-enable-at-startup nil)
;; -DisablePackage
#+end_src

** Startup performance

Make startup faster by reducing the frequency of garbage collection and then use
a hook to measure Emacs startup time.

#+begin_src emacs-lisp
;; DefferGC
(setq site-run-file nil                  ; No site-wide run-time initializations.
      inhibit-default-init t             ; No site-wide default library
      gc-cons-threshold (* 50 1024 1024) ; The default is 800 kilobytes. Measured in bytes.
      gc-cons-percentage 0.2
      native-comp-eln-load-path (list (expand-file-name "eln-cache" user-emacs-directory)))
;; -DefferGC
#+end_src

After change the default values, I need to restore them when Emacs is launched
with the following code in the /init.el/ file.

#+INCLUDE: "init.el" src emacs-lisp :range-begin "BetterGC" :range-end "-BetterGC" :lines "27-35"

Also, we can prevent launch the hook associated with some files modification in
startup and reenable it after all the process is completed. From [[https://github.com/MatthewZMD/.emacs.d][MatthewZMD]]

#+begin_quote
Every file opened and loaded by Emacs will run through this list to check for a
proper handler for the file, but during startup, it won’t need any of them.
#+end_quote

#+begin_src emacs-lisp
;; FilenameHandler
(defvar file-name-handler-alist-original file-name-handler-alist)
(setq file-name-handler-alist nil)
;; -FilenameHandler
#+end_src

*** Disable unnecessary interface
#+begin_src emacs-lisp
;; DefaultUI
(menu-bar-mode -1)
(unless (and (display-graphic-p) (eq system-type 'darwin))
  (push '(menu-bar-lines . 0) default-frame-alist))
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
;; -DefaultUI
#+end_src

#+begin_src emacs-lisp
(provide 'early-init)
;;; early-init.el ends here
#+end_src


* Boostrap configuration

The init file is the entry point. This file should have the base
setting and import the rest of the modules.

#+begin_src emacs-lisp
<<header>>

<<require>>
#+end_src

** Update load path

Add the lisp script to the path
#+INCLUDE: "init.el" src emacs-lisp :range-begin "UpdatePath" :range-end "-UpdatePath" :lines "38-51"

** Load our modules
After add the custom path, it is necessary to load the correspondent modules

#+INCLUDE: "init.el" src emacs-lisp :range-begin "InitRequire" :range-end "-InitRequire" :lines "56-58"

** Package system

For package management I combine ~use-package~ with [[https://github.com/radian-software/straight.el][straight]]. To boot the process,
I will disable the checking step that ensure the system has the newest version
of each package.

#+INCLUDE: "modules/init-package.el" src emacs-lisp :range-begin "Straight" :range-end "-Straight" :lines "28-49"

In systems different to Linux, I don't use straight, I prefer to use the default
one system.

#+INCLUDE: "modules/init-package.el" src emacs-lisp :range-begin "DefaultpackageManagement" :range-end "-DefaultpackageManagement" :lines "53-58"

When Emacs uses the default package manager, it is needed to install ~use-package~

#+NAME: UsePackage
#+INCLUDE: "modules/init-package.el" src emacs-lisp :range-begin "UsePackage" :range-end "UsePackage" :lines "61-75"

Gutter all and export the package. I used to us the ~noweb~ method in order to
setup the different parts. In this case, I am including the different parts from
code, so I will simulate it.

#+begin_src emacs-lisp
(if (eq system-type 'gnu/linux)
    (progn
      ;; Copy the straight part
      <<straight>>
      )
  (progn
    ;; Copy the DefaultpackageManagement part
    <<DefaultPackageManagement>>
    ;; Copy the UsePackage part
    <<UsePackage>>
    )
)
#+end_src

** Define constants

*** Get environment variables

This part aims to setting some special configuration based on the system Emacs is running

#+INCLUDE: "modules/init-consts.el" :range-begin "MachineInfo" :range-end "-MachineInfo" :lines "26-41"

*** Get User info

*Note* I use the git configuration to get this values, but you are free to
customize them.

#+INCLUDE: "modules/init-consts.el" :range-begin "UserInfo" :range-end "-UserInfo"  :lines "44-51"

*** Runtime constants

#+INCLUDE: "modules/init-consts.el" :range-begin "Consts" :range-end "-Consts"  :lines "2-70"

* Dashboard

Emacs Dashboard is an extensible startup screen showing you recent files, bookmarks, agenda items and an Emacs banner.

#+begin_src emacs-lisp
(use-package dashboard
  :disabled
  :diminish (dashboard-mode)
  :init      ;; tweak dashboard config before loading it
  (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*"))
        dashboard-banner-logo-title "Welcome to Emacs!"
        dashboard-set-navigator t
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-startup-banner 'logo
        dashboard-center-content nil
        dashboard-items '((recents   . 5)
                          (agenda    . 5 )
                          (projects  . 5))
        dashboard-display-icons-p t ;; display icons on both GUI and terminal
        dashboard-icon-type 'nerd-icons) ;; use `nerd-icons' package
  :config
  (dashboard-setup-startup-hook)
  :custom
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book"))))
#+end_src

* General configuration

** Keep it clean

First I define the default emacs back-up where all the cache files will be
stored. I set the emacs directory in early-init to prevent emacs install staffs
inside the config folder. Use no-littering to automatically set common paths to
the new user-emacs-directory. Then define where will be store the temporal files

#+begin_src emacs-lisp
(setq backup-by-copying      t   ; instead of renaming current file (clobbers links)
      create-lockfiles       nil
      make-backup-files      t   ; Backup of a file the first time it is saved.
      backup-by-copying      t   ; Don't delink hardlinks
      version-control        t   ; Use version numbers on backups
      delete-old-versions    t   ; Automatically delete excess backups
      kept-new-versions      6   ; how many of the newest versions to keep
      kept-old-versions      5   ; and how many of the old
      auto-save-default      t
      ;; Don't auto-disable auto-save after deleting big chunks. This defeats
      ;; the purpose of a failsafe. This adds the risk of losing the data we
      ;; just deleted, but I believe that's VCS's jurisdiction, not ours.
      auto-save-include-big-deletions t
      require-final-newline           t)
#+end_src

Also I will change the location of the ~custom-file.el~, setting it in the config folder

#+begin_src emacs-lisp
(setq custom-file (expand-file-name "custom.el" private-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file 'noerror 'nomessage))
#+end_src

*** No littering
#+begin_src emacs-lisp
(use-package no-littering
  :demand t
  :config
  (let ((backup-dir (no-littering-expand-var-file-name "backup/")))
    (make-directory backup-dir t)
    (setq backup-directory-alist
          `(("\\`/tmp/" . nil)
            ("\\`/dev/shm/" . nil)
            ("." . ,backup-dir)))))
#+end_src

** Startup screen

#+begin_src emacs-lisp
(setq-default inhibit-startup-screen  t
              inhibit-startup-message t
              inhibit-startup-echo-area-message user-full-name)
#+end_src

** Default encoding

#+begin_src emacs-lisp
;; Set encding by default
(set-default-coding-systems 'utf-8)     ; Default to utf-8 encoding
(prefer-coding-system       'utf-8)     ; Add utf-8 at the front for automatic detection.
(set-terminal-coding-system 'utf-8)     ; Set coding system of terminal output
(set-keyboard-coding-system 'utf-8)     ; Set coding system for keyboard input on TERMINAL
(set-language-environment "English")    ; Set up multilingual environment
#+end_src

** Disable warnings when native compilation

#+begin_src emacs-lisp
(setq native-comp-async-report-warnings-errors nil)
;; Set the right directory to store the native comp cache
(add-to-list
  'native-comp-eln-load-path
  (expand-file-name "eln-cache/" user-emacs-directory))
#+end_src

** Recovery

If Emacs or the computer crashes, you can recover the files you were editing at
the time of the crash from their auto-save files. To do this, start Emacs again
and type the command M-x recover-session. Here, we parameterize how files are
saved in the background.

#+begin_src emacs-lisp
(setq auto-save-list-file-prefix ; Prefix for generating auto-save-list-file-name
      (expand-file-name ".auto-save-list/.saves-" user-emacs-directory)
      auto-save-default t        ; Auto-save every buffer that visits a file
      auto-save-timeout 20       ; Number of seconds between auto-save
      auto-save-interval 200)    ; Number of keystrokes between auto-saves

#+end_src

